index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fan: metaprogramming for OCaml</title>
<!-- 2013-06-01 Sat 21:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Hongbo Zhang"/>
<link rel="stylesheet" type="text/css" href="stylesheets/styles.css" />
</head>
<body>
<div id="content">
<h1 class="title">Fan: metaprogramming for OCaml</h1>
<div class="wrapper">
<header>
<ul>
<li class="download"><a class="buttons" href="https://github.com/bobzhang/Fan/zipball/master">Download ZIP</a></li>
<li class="download"><a class="buttons" href="https://github.com/bobzhang/Fan/tarball/master">Download TAR</a></li>
<li><a class="buttons github" href="https://github.com/bobzhang/Fan">View On GitHub</a></li>
</ul>

<p class="header">Maintained by
<a class="header name" href="https://github.com/bobzhang">Hongbo Zhang</a>
</p>
</header>
<section>

<p>
<a href="https://github.com/bobzhang/Fan">Fan</a> is a compile-time metaprogramming system for <a href="http://caml.inria.fr/">OCaml</a>, originally
inspired from <a href="http://brion.inria.fr/gallium/index.php/Camlp4">Camlp4</a>. It's a combination of OCaml and Lispy
<a href="http://letoverlambda.com/">Macros</a>. It shares the same concrete syntax with OCaml.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Getting started</h2>
<div class="outline-text-2" id="text-1">
<p>
See here: <a href="start.html">Fan for beginners</a>, enjoy!
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Status</h2>
<div class="outline-text-2" id="text-2">
<p>
Please bear in mind that Fan is still at alpha release, so it's
expected there would be many bugs. This also means that your
participation is particularly important, and your suggestions will
affect the design of Fan.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Contributions</h2>
<div class="outline-text-2" id="text-3">
<p>
Contributions are very welcome
</p>

<ul class="org-ul">
<li><a href="https://github.com/bobzhang/Fan">Code repo</a>
</li>

<li><a href="https://github.com/bobzhang/Fan/tree/gh-pages">Documentation repo</a> 

<p>
It's written in <a href="http://orgmode.org/">org-mode</a> markup language.  If you are
unfamiliar with org files, markdown or html patches are welcome as
well.  Help on building the website is deeplhalso appreciated.
</p>
</li>

<li><a href="foo.docdir/index.html">Ocamldoc API</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Acknowledgments</h2>
<div class="outline-text-2" id="text-4">
<p>
See <a href="credits.html">History</a>
</p>
</div>
</div>
</div>
</body>
</html>